blueage/folotoy/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 详情页的大字验证码。屏幕上只有一行大字，28 号是 240 px 宽度下
# "八位分组码 + 空格"仍不换行的最大字号。
CONFIG_LV_FONT_MONTSERRAT_28=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 列表页同时存在四行面板 + 标签 + 进度条,24KB 偏紧,取 32KB。
CONFIG_LV_MEM_SIZE_KILOBYTES=32

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# CPU 主频。这点 UI 负载 80 MHz 绰绰有余，而 160 MHz 大约多耗 8~10 mA，
# 对 520 mAh 的电池不是小数。ESP32-C3 的 APB 固定 80 MHz，不受此项影响，
# 因此 SPI 屏的 40 MHz 时钟照旧。
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80

# --- SNTP ---
# 开机对时配了三个服务器（见 main/otp_wifi.c），默认上限是 1。
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# 关掉首包随机延迟。它默认在发第一个请求前随机等 0~5 秒，用意是避免成千上万台
# 设备同时开机把公共 NTP 池打爆；但对单台设备而言，它白白吃掉了我们 10 秒对时
# 预算的一半——真机上已经因此超时过两次。
CONFIG_LWIP_SNTP_STARTUP_DELAY=n

# --- 编译优化 ---
# 默认的 -Og 会让镜像逼近 1 MB。注意上限不是 factory 的 3 MB：ESP-IDF 按
# **最小的 app 分区**（1 MB 的 recovery）做体积检查，而 recovery 的地址与大小
# 是小程序安装契约的一部分，不能动。要塞下 Wi-Fi 协议栈就只能从这里省。
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；同步服务只需要单连接 peripheral。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n

# 网页一次长写（Chrome 的 prepare/execute）会攒成一个 ATT 事务，
# 这里给足队列写的缓冲，免得同步帧被 ATT 层拆坏。
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247

# host 任务栈。默认 4 KB，我们的回调链（GATT 写 → 线格式解析 → 回帧）本身很浅，
# 但 4 KB 没有任何余量：一个 2.6 KB 的栈上局部变量就把它撑爆过（订阅通知时崩在
# send_status）。真正的修法是不在这条栈上放大对象（见 otp_vault_count），
# 这里再加 2 KB 只是纵深防御。
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144
